#include <stdio.h>

//强制类型转换

int main() {
    int i = 5;
    float j = i / 2;  //这里做的是整型运算，因为左右操作数都是整型
    float k = (float) i / 2;
    printf("j = %f\n", j);  //j=2.000000
    printf("k = %f\n", k);  //k=2.500000

    /*
     * printf函数可以输出各种类型的数据，包括整型、浮点型、字符型、字符串型等，
     * 实际原理是printf函数将这些类型的数据格式化为字符串后，放入标准输出缓冲区，然后将结果显示到屏幕上。
    */
    int age = 15;
    printf("你好 %s, 你今年 %d 岁了。\n","jack",age);

    //控制格式
    int m =10;
    float n = 3.1415926;
    printf("学生的学号为%-4d,分数为%4.2f\n",m,n);   //结尾保留两位小数
    m =1001;
    n = 3.1415926;
    printf("学生的学号为%4d,分数为%4.2f\n",m,n);  //%4d和%4.2f可以把学号的格式对齐,默认右对齐，加负号改成左对齐

    return 0;
}
